Revit 2027 API
HemisphericalLightDistribution Constructor
 Creates a hemispherical light distribution object.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HemisphericalLightDistribution()
Public Sub New
public:
HemisphericalLightDistribution()
new : unit -> HemisphericalLightDistribution
See Also
Reference
HemisphericalLightDistribution Class
HemisphericalLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace